# Datos del Titanic

In [3]:
import seaborn as sn #Paquete que tiene muchos data sets incluidos automatiamente

In [4]:
titanic = sn.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
import numpy as np
import pandas as pd

In [6]:
titanic['survived'] = pd.Categorical(titanic['survived']) #Convierto de una variable numerica 
                                                         #para una categorica para este estudio
titanic['pclass'] = pd.Categorical(titanic['pclass']) #Convierto de una variable  
                                                         #para una categorica para este estudio
titanic['sex'] = pd.Categorical(titanic['sex']) #Convierto de una variable  
                                                         #para una categorica para este estudio

## Tablas de contigencia de una variable

In [7]:
#Variables
#Cantidad de personas que sobrevivieron
tab = pd.crosstab(index = titanic['survived'], #Funci贸n para determinar valores de 1 columna
                                              #En especificio y que agrupa
                 columns = 'Pasajeros') #Agrego el nombre para esa columna
tab

col_0     Pasajeros
survived
0               549
1               342

In [8]:
type(tab) #Para saber que tipo de variable es. En este caso dice que es un data frame

pandas.core.frame.DataFrame

In [9]:
pd.crosstab(index = titanic['pclass'], #Identifico la clase de los pasajeros
           columns = 'pasajeros') #Agrego el nombre

col_0   pasajeros
pclass
1             216
2             184
3             491

In [10]:
pd.crosstab(index = titanic['sex'], #Escogo la variable sexo para saber cuantos hombres o mujeres habian
           columns = 'pasajeros')

col_0   pasajeros
sex
female        314
male          577

In [11]:
tab_c = pd.crosstab(index = titanic['deck'], #Cabinas donde estavan alojados los pasajeros
           columns = 'count') #Para efectos de desarollo el valor correcto es count para estas respuestas
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [12]:
tab_c.sum() #Total de cabinas que habian en el barco

col_0
count    203
dtype: int64

In [13]:
tab_c.shape #7 columnas que son las categorias de cabinas

(7, 1)

In [14]:
tab_c.iloc[1:5] #Para tenre los valores de la categoria 1 hasta la 5

col_0  count
deck
B         47
C         59
D         33
E         32

In [15]:
tab_c/tab_c.sum() #Frecuencias relativas de las categorias

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

### Tablas de contingencia de dos variables

In [16]:
survived_sex = pd.crosstab(index = titanic['survived'], #Fila de sobrevivientes
                          columns = titanic['sex']) #Columnas por sexo
#Agregando nombre significativo a la etiqueta
survived_sex.index = ['Died', 'Survived'] #Cambie de 0 y 1 para el nombre
survived_sex

sex       female  male
Died          81   468
Survived     233   109

In [17]:
survived_class = pd.crosstab(index = titanic['survived'],
                            columns = titanic['pclass'])
#Agregando nombre significativo a la etiqueta
survived_class.index = ['Muertos', 'Vivos'] #Cambie de 0 y 1 para el nombre
survived_class.columns = ['Primera', 'Segunda', 'Tercera'] #Cambie de numeros para las letras la etiqueta
survived_class

         Primera  Segunda  Tercera
Muertos       80       97      372
Vivos        136       87      119

In [18]:
survived_class = pd.crosstab(index = titanic['survived'],
                            columns = titanic['pclass'],
                            margins = True) #Para tener la frecuencia global
#Al agregar el margin = true devo adicionar una etiqueta mas para tener los valores de la variable global

#Agregando nombre significativo a la etiqueta
survived_class.index = ['Muertos', 'Vivos', 'Total_Clase'] #Cambie de 0 y 1 para el nombre
survived_class.columns = ['Primera', 'Segunda', 'Tercera','Total_Supervivencia'] #Cambie de numeros para 
                                                                                 #las letras la etiqueta
survived_class

             Primera  Segunda  Tercera  Total_Supervivencia
Muertos           80       97      372                  549
Vivos            136       87      119                  342
Total_Clase      216      184      491                  891

### Frecuencia relativa global

In [19]:
#Se deve usar el parametro loc para determinar la frecuencia relativa global
survived_class/survived_class.loc['Total_Clase', 'Total_Supervivencia']

              Primera   Segunda   Tercera  Total_Supervivencia
Muertos      0.089787  0.108866  0.417508             0.616162
Vivos        0.152637  0.097643  0.133558             0.383838
Total_Clase  0.242424  0.206510  0.551066             1.000000

### Frecuencias relativas marginales

In [20]:
survived_class/survived_class.loc['Total_Clase'] #Aqui dividiria la columna /total de la columna

             Primera   Segunda   Tercera  Total_Supervivencia
Muertos      0.37037  0.527174  0.757637             0.616162
Vivos        0.62963  0.472826  0.242363             0.383838
Total_Clase  1.00000  1.000000  1.000000             1.000000

In [22]:
survived_class.div(survived_class.loc['Total_Clase'], axis = 1) #Frecuencia relativas por columnas

             Primera   Segunda   Tercera  Total_Supervivencia
Muertos      0.37037  0.527174  0.757637             0.616162
Vivos        0.62963  0.472826  0.242363             0.383838
Total_Clase  1.00000  1.000000  1.000000             1.000000

In [40]:
#Para determinar ahora la relativa marginal tiene 2 opciones. Sigue:
# opci贸n1
#    Traspongo   / No necesita la funci贸n loc
survived_class.T/survived_class['Total_Supervivencia']

                      Muertos     Vivos  Total_Clase
Primera              0.145719  0.397661     0.242424
Segunda              0.176685  0.254386     0.206510
Tercera              0.677596  0.347953     0.551066
Total_Supervivencia  1.000000  1.000000     1.000000

In [43]:
# opci贸n2
survived_class.div(survived_class['Total_Supervivencia'],  axis = 0)

              Primera   Segunda   Tercera  Total_Supervivencia
Muertos      0.145719  0.176685  0.677596                  1.0
Vivos        0.397661  0.254386  0.347953                  1.0
Total_Clase  0.242424  0.206510  0.551066                  1.0

### Tablas multi dimensionales

In [26]:
surv_sex_class = pd.crosstab(index = titanic['survived'],
                             columns = [titanic['sex'], titanic['pclass']],
                             margins = True)
surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [27]:
surv_sex_class['female'] #Aqui filtro las mujeres por supervivencia y clase social

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [28]:
surv_sex_class['female'][1] #Resultado de mujeres de 1ra clase que sobrevivieron y murieron

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [29]:
#Relativa global por columnas
surv_sex_class/surv_sex_class.loc['All']

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000